/* module : 44 er 2 =  */
/* video title = ওয়েব কম্পোনেন্ট, 4 ধরনের কম্পোনেন্ট, আইডেন্টিফাই কম্পোনেন্ট */
// component, 4 ধরনের কম্পোনেন্ট
// 1.similar in look, different is data/চেহারাতে একই রকম, ডেটা আলাদা
// 2.container component/কন্টেইনার উপাদান
// 3.no pattern,but breakdown for working purpose//কোন প্যাটার্ন নেই, তবে কাজের উদ্দেশ্যে ভাঙ্গন
// 4.stand-alone component/একাকী উপাদান

/* module : 44 er 4 =  */
/* video title = একক পৃষ্ঠা অ্যাপ্লিকেশন (SPA), কর্মক্ষমতা সুবিধা */
// SPA = single page application benefits (google search)
// 1. অনেক ক্ষেত্রে একটি SPA (যেটি খুব কমই উল্লেখ করা হয়) এর একটি প্রধান স্থাপত্য সুবিধা আপনার অ্যাপ্লিকেশনের "চেতনা" এর বিশাল হ্রাস। যদি আপনি ক্লায়েন্টের সর্বাধিক প্রক্রিয়াকরণের জন্য এটি সঠিকভাবে ডিজাইন করেন (সমগ্র বিন্দু, সব পরে), তারপরে সার্ভারে অনুরোধগুলির সংখ্যা ("503 ত্রুটিগুলির জন্য আপনার সম্ভাবনার ক্ষতিকারক সম্ভাবনাগুলি" পড়ুন) নাটকীয়ভাবে হ্রাস পেয়েছে। আসলে, একটি এসপিএ সম্পূর্ণরূপে অফলাইন প্রক্রিয়াকরণ করতে সক্ষম করে, যা কিছু পরিস্থিতিতে বড়। 
// 2. পারফরম্যান্সটি সঠিকভাবে আপনি যদি ক্লায়েন্ট-পার্শ্ব রেন্ডারিংয়ের সাথে ভাল তবে এটি একটি SPA নির্মাণের জন্য সবচেয়ে বাধ্যতামূলক কারণ নয়। (নেটওয়ার্ক গতি সব পরে, উন্নতি হয়।) এই ভিত্তিতে একা SPA জন্য মামলা করবেন না।
// 3. আপনার UI ডিজাইনের নমনীয়তা সম্ভবত আমি পেয়েছি অন্য প্রধান সুবিধা। একবার আমি আমার API (জাভাস্ক্রিপ্টে একটি SDK সহ) সংজ্ঞায়িত করেছি, আমি কিছু স্ট্যাটিক রিসোর্স ফাইলগুলির থেকে সরাইয়া সার্ভারে শূন্য প্রভাব সহ আমার সামনে-শেষটি পুনরায় লিখতে সক্ষম হয়েছিলাম। ঐতিহ্যগত এমভিসি অ্যাপ্লিকেশন দিয়ে এটি করার চেষ্টা করুন! :) (এটি যখন আপনার API এর লাইভ স্থাপনার এবং সংস্করণ একত্রীকরণের জন্য উদ্বিগ্ন হয় তখন এটি মূল্যবান হয়ে ওঠে।)

/* module : 44 er 5 =  */
/* video title = রাউটিং, রুট প্যারামিটার, প্রতিক্রিয়ায় রাউটিং */
// 1.single page application a rout use kore rout er upo dipens kore same page er upo click kore bibino jinis dekhay.